src/toir_cfe/src/DataProcessors/торо_РабочееМестоТехническогоСпециалиста/торо_РабочееМестоТехническогоСпециалиста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="57985ced-0cfd-4a5a-a4b6-c9b1f1c12be2">
  <name>торо_РабочееМестоТехническогоСпециалиста</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

src/toir_cfe/src/AccumulationRegisters/проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт/проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6ae04480-96d0-4b42-a38a-77468b8202a6">
  <name>проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="08ca1fe2-22ec-4b93-a944-e923fd69ea51">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="b0a906f0-c1ef-48b1-9e3c-1419f3d9e085">
    <name>АктОВыполненииЭтапаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cf269c73-3461-41b0-b4ca-c1d0165d64a0">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="94b5fc89-114f-4c0b-bbfc-774d7d18f1fb">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/InformationRegisters/проф_СоответствиеАктовИВнутреннегоПотребления/проф_СоответствиеАктовИВнутреннегоПотребления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="130135bc-6ef7-49b3-a04b-5bc1ac9bc395">
  <name>проф_СоответствиеАктовИВнутреннегоПотребления</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d15325de-7741-4201-8ce8-1d3a8f63ff25">
    <name>ЗавершитьРемонтныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d603a23b-cb84-4368-b6a8-5133934e19c1">
    <name>ДатаЗавершенияРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b5883e72-7c55-42da-9ff6-793fbe62c9da">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="59ed475b-67c0-4e52-ac68-9a85f30b3cc8">
    <name>АктОВыполненииЭтапаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ef07c920-2fe5-4012-ab01-8098ed0e8aca">
    <name>ВнутреннееПотреблениеТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c9fd5a1a-3aa5-4048-b15e-f8b6a41ab96f">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f81fa13f-989c-43f8-a8bc-c4493200a00f">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="951a5403-e1a4-4484-8fda-c18df8f291d3">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="57507687-e857-4627-84a6-131b6dc5555a">
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="898c017b-174f-4670-8146-5c6e75af51c1">
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d257be95-baab-4cf8-b5ae-541216c91b07">
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e654eb8f-cadf-4ea9-b106-6855158dcb94">
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Documents/ВнутреннееПотреблениеТоваров/ВнутреннееПотреблениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотреблениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f821681-4f9b-4186-85f8-a081e4ab09cf">
    <name>ПотреблениеПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a69f874-6aec-457e-8ade-4fb7762659ab">
    <name>проф_ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="048b6482-1229-4a9b-bde1-a32f6b28cf3d">
    <name>проф_ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c978a924-8a72-4669-a86a-a1e5e31fd099">
    <name>ЕстьРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="54be410d-2466-478e-8cf5-434ec98e19f1">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1b8217a5-5b59-453d-b479-c9c962e72312">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="39aa0f15-c415-409c-a64b-12fd0ee1e845">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_АктОВыполненииЭтапаРабот/торо_АктОВыполненииЭтапаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b863b14e-c352-4234-8c63-d86d97f12044">
  <name>торо_АктОВыполненииЭтапаРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="6a750754-4a73-402d-8f35-6a379ec1cb60">
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="23087b8e-d21e-4499-beac-8287045096a2">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="35c6e5ea-774c-4081-b20e-6b7733152e33">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f458fa39-e462-44c2-a688-fb165a2c6c8d">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="41c9c7b6-5db5-492f-8a78-0e1fb54a88c4">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/проф_СписаниеТМЦНеТребуется/проф_СписаниеТМЦНеТребуется.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ca4e2695-9435-4dc8-bc67-1e1b083768a6">
  <name>проф_СписаниеТМЦНеТребуется</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="9d832bb0-64b9-49b8-b5dd-465b88c7685a">
    <name>АктОВыполненииЭтапаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3adb3e12-f1c0-44a0-9e2d-3d7cc811d060">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="729eb4a4-ca85-43aa-be62-5d2115baea8a">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0b3df086-16ce-4fc2-8914-c13393e2afa0">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="810fda09-bdf9-4eb2-93e2-0828822e19e5">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0ff0dc43-64c3-4d91-8f22-e53abc933783">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/DataProcessors/торо_РабочееМестоТехническогоСпециалиста/Forms/проф_ФормаСписаниеТМЦ/Module.bsl
//++ Проф-ИТ, #329, Соловьев А.А., 08.11.2023

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗакрытыеАкты(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПолнуюТаблицуРасшифровки();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытыеАкты(Команда)
	
	Элементы.АктыИЗаказыЗакрытыеАкты.Пометка = Не Элементы.АктыИЗаказыЗакрытыеАкты.Пометка;
	
	ЭтотОбъект.АктыИЗаказы.Отбор.Элементы.Очистить();
	
	Если Элементы.АктыИЗаказыЗакрытыеАкты.Пометка Тогда 
		
		ЭлементОтбора = ЭтотОбъект.АктыИЗаказы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗавершитьРемонтныеРаботы");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Элементы.АктыИЗаказыЗакрытыеАкты.Пометка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицы(Команда)
	
	ОбновлениеТаблиц(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетКоличествоНеСписанныхТМЦ(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.проф_КоличествоНеСписанныхТМЦ.Форма", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СводныйДокументВнутреннееПотребление(Команда)
	
	ТекущиеДанные = Элементы.АктыИЗаказы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = ДанныеДокументаАктОВыполненииЭтапаРабот(ТекущиеДанные.АктПоРемонту, ТекущиеДанные.ВнутреннееПотребление);
	
	Если СтруктураПараметров = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если СтруктураПараметров.МассивСтрокНоменклатуры.Количество() = 0 Тогда
		
		СтруктураПараметровОповещения = Новый Структура("МассивID, СтрокаКомментария", 
			СтруктураПараметров.МассивID, СтруктураПараметров.СтрокаКомментария);
		ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьЗаказЗавершение", ЭтотОбъект, СтруктураПараметровОповещения);
		СтрокаВопроса = НСтр("ru = 'По ремонту отсутствуют материальные затраты или по всем материальным затратам
			|созданы заказы на потребление. Ввести новый заказ на внутреннее потребление?'");
		ПоказатьВопрос(ОписаниеОповещения, СтрокаВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	СтруктураПередаваемыхВОбработчикПараметров = Новый Структура;
	СтруктураПередаваемыхВОбработчикПараметров.Вставить("МассивID", СтруктураПараметров.МассивID);
	СтруктураПередаваемыхВОбработчикПараметров.Вставить("АктПоРемонту", ТекущиеДанные.АктПоРемонту);
	
	СтруктураПараметровДокумента = Новый Структура("ЗначенияЗаполнения", СтруктураПараметров);
	СтруктураПараметровДокумента.Вставить("ID", СтруктураПараметров.МассивID);
	
	ИмяОбработчика = "ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументовСводный";
	ОписаниеОповещения = Новый ОписаниеОповещения(ИмяОбработчика, ЭтаФорма, СтруктураПередаваемыхВОбработчикПараметров);
	ОткрытьФорму("Документ.ВнутреннееПотреблениеТоваров.Форма.ФормаДокумента", 
		СтруктураПараметровДокумента, ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СписаниеНеТребуется(Команда)
	
	ВыбранныеСтроки = Расшифровка.НайтиСтроки(Новый Структура("СформироватьДокумент", Истина));
	
	Если ВыбранныеСтроки.Количество() = 0 Тогда 
		ТекстСообщения = НСтр("ru = 'Выберите строки для создания документа'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеАкт = Элементы.АктыИЗаказы.ТекущиеДанные;
	СписаниеНеТребуетсяНаСервере(ТекущиеДанныеАкт.АктПоРемонту);
	ОбновлениеТаблиц(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАктыИЗаказы

&НаКлиенте
Процедура АктыИЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.АктыИЗаказы.ТекущиеДанные;
	Если Поле.Имя <> "АктыИЗаказыДатаЗавершенияРемонта" Тогда 
		ИмяКолонки = СтрЗаменить(Поле.Имя, "АктыИЗаказы", "");
		ПоказатьЗначение(, ТекущиеДанные[ИмяКолонки]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктыИЗаказыПриАктивизацииСтроки(Элемент)
	
	Расшифровка.Очистить();
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		СтруктураОтбора = Новый Структура("АктПоРемонту", ТекущиеДанные.АктПоРемонту);
		СтрокиРасшифровки = РасшифровкаПолная.НайтиСтроки(СтруктураОтбора);
		
		Для Каждого СтрокаРасшифровки Из СтрокиРасшифровки Цикл
			НоваяСтрока = Расшифровка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасшифровки);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РасшифровкаСформироватьДокумент.Имя);
	ПолеПравоеЗначение = Новый ПолеКомпоновкиДанных("Расшифровка.КоличествоВП");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, 
		"Расшифровка.КоличествоАкт", ВидСравненияКомпоновкиДанных.Равно, ПолеПравоеЗначение, , Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПолнуюТаблицуРасшифровки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонтОстатки.АктОВыполненииЭтапаРабот КАК АктОВыполненииЭтапаРабот,
	|	проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонтОстатки.Номенклатура КАК Номенклатура,
	|	проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонтОстатки.Характеристика КАК Характеристика,
	|	проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонтОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	РегистрНакопления.проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт.Остатки КАК проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонтОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОстатки.АктОВыполненииЭтапаРабот КАК АктПоРемонту,
	|	проф_СоответствиеАктовИВнутреннегоПотребления.ВнутреннееПотреблениеТоваров КАК ВнутреннееПотребление,
	|	втОстатки.Номенклатура КАК Номенклатура,
	|	втОстатки.Характеристика КАК Характеристика,
	|	втОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ втСоответвие
	|ИЗ
	|	втОстатки КАК втОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.проф_СоответствиеАктовИВнутреннегоПотребления КАК проф_СоответствиеАктовИВнутреннегоПотребления
	|		ПО втОстатки.АктОВыполненииЭтапаРабот = проф_СоответствиеАктовИВнутреннегоПотребления.АктОВыполненииЭтапаРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСоответвие.АктПоРемонту КАК АктПоРемонту,
	|	втСоответвие.ВнутреннееПотребление КАК ВнутреннееПотребление,
	|	втСоответвие.Номенклатура КАК НоменклатураАкт,
	|	втСоответвие.Характеристика КАК ХарактеристикаАкт,
	|	втСоответвие.КоличествоОстаток КАК КоличествоАкт,
	|	ВнутреннееПотреблениеТоваровТовары.Номенклатура КАК НоменклатураВП,
	|	ВнутреннееПотреблениеТоваровТовары.Характеристика КАК ХарактеристикаВП,
	|	ВнутреннееПотреблениеТоваровТовары.Количество КАК КоличествоВП
	|ИЗ
	|	втСоответвие КАК втСоответвие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК ВнутреннееПотреблениеТоваровТовары
	|		ПО втСоответвие.ВнутреннееПотребление = ВнутреннееПотреблениеТоваровТовары.Ссылка
	|			И втСоответвие.Номенклатура = ВнутреннееПотреблениеТоваровТовары.Номенклатура
	|			И втСоответвие.Характеристика = ВнутреннееПотреблениеТоваровТовары.Характеристика
	|			И втСоответвие.КоличествоОстаток = ВнутреннееПотреблениеТоваровТовары.Количество
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втСоответвие.АктПоРемонту,
	|	втСоответвие.ВнутреннееПотребление,
	|	втСоответвие.Номенклатура,
	|	втСоответвие.Характеристика,
	|	ВнутреннееПотреблениеТоваровТовары.Количество,
	|	ВнутреннееПотреблениеТоваровТовары.Номенклатура,
	|	ВнутреннееПотреблениеТоваровТовары.Характеристика,
	|	ВнутреннееПотреблениеТоваровТовары.Количество
	|ИЗ
	|	втСоответвие КАК втСоответвие
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК ВнутреннееПотреблениеТоваровТовары
	|		ПО втСоответвие.ВнутреннееПотребление = ВнутреннееПотреблениеТоваровТовары.Ссылка
	|			И втСоответвие.Номенклатура = ВнутреннееПотреблениеТоваровТовары.Номенклатура
	|			И втСоответвие.Характеристика = ВнутреннееПотреблениеТоваровТовары.Характеристика
	|			И втСоответвие.КоличествоОстаток > ВнутреннееПотреблениеТоваровТовары.Количество
	|ГДЕ
	|	ЕСТЬNULL(ВнутреннееПотреблениеТоваровТовары.Количество, 0) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втСоответвие.АктПоРемонту,
	|	втСоответвие.ВнутреннееПотребление,
	|	втСоответвие.Номенклатура,
	|	втСоответвие.Характеристика,
	|	втСоответвие.КоличествоОстаток - ЕСТЬNULL(ВнутреннееПотреблениеТоваровТовары.Количество, 0),
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	0
	|ИЗ
	|	втСоответвие КАК втСоответвие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК ВнутреннееПотреблениеТоваровТовары
	|		ПО втСоответвие.ВнутреннееПотребление = ВнутреннееПотреблениеТоваровТовары.Ссылка
	|			И втСоответвие.Номенклатура = ВнутреннееПотреблениеТоваровТовары.Номенклатура
	|			И втСоответвие.Характеристика = ВнутреннееПотреблениеТоваровТовары.Характеристика
	|			И (втСоответвие.КоличествоОстаток > ЕСТЬNULL(ВнутреннееПотреблениеТоваровТовары.Количество, 0))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втСоответвие.АктПоРемонту,
	|	ВнутреннееПотреблениеТоваровТовары.Ссылка,
	|	втСоответвие.Номенклатура,
	|	втСоответвие.Характеристика,
	|	втСоответвие.КоличествоОстаток,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	0
	|ИЗ
	|	втСоответвие КАК втСоответвие
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК ВнутреннееПотреблениеТоваровТовары
	|		ПО втСоответвие.ВнутреннееПотребление = ВнутреннееПотреблениеТоваровТовары.Ссылка
	|			И втСоответвие.Номенклатура = ВнутреннееПотреблениеТоваровТовары.Номенклатура
	|			И втСоответвие.Характеристика = ВнутреннееПотреблениеТоваровТовары.Характеристика
	|ГДЕ
	|	ВнутреннееПотреблениеТоваровТовары.Количество ЕСТЬ NULL";
	
	РасшифровкаПолная.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеТаблиц(ОбновитьРасшифровку)
	
	Элементы.АктыИЗаказы.Обновить();
	Если ОбновитьРасшифровку Тогда 
		ЗаполнитьПолнуюТаблицуРасшифровки();
	КонецЕсли;
	АктыИЗаказыПриАктивизацииСтроки(Элементы.АктыИЗаказы);
	
КонецПроцедуры

&НаКлиенте 
Процедура ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументовСводный(Результат, ДополнительныеПараметры) Экспорт
	
	ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументовСервер(Результат, ДополнительныеПараметры);
	ОбновлениеТаблиц(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеДокументаАктОВыполненииЭтапаРабот(ДокументСсылка, ВнутреннееПотребление)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID КАК ID,
	|	торо_АктОВыполненииЭтапаРабот.Организация КАК Организация,
	|	торо_АктОВыполненииЭтапаРабот.Подразделение КАК Подразделение
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот КАК торо_АктОВыполненииЭтапаРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	|		ПО торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка = торо_АктОВыполненииЭтапаРабот.Ссылка
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРабот.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ID КАК ID,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Количество КАК Количество,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Сумма КАК Сумма,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.КоличествоЕдиниц КАК КоличествоЕдиниц
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты КАК торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.ID КАК ID,
	|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.Номенклатура КАК Номенклатура,
	|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.СерияНоменклатуры КАК СерияНоменклатуры,
	|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.НоменклатураНовая КАК НоменклатураНовая,
	|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.ХарактеристикаНоменклатурыНовая КАК ХарактеристикаНоменклатурыНовая,
	|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.СерияНоменклатурыНовая КАК СерияНоменклатурыНовая,
	|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.СтатусДвиженияСерийныхЗЧ КАК СтатусДвиженияСерийныхЗЧ,
	|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.Количество КАК Количество,
	|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.СтатусДвиженияНовойЗЧ КАК СтатусДвиженияНовойЗЧ,
	|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.ЕдиницаИзмеренияНовая КАК ЕдиницаИзмеренияНовая,
	|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.КоличествоНовое КАК КоличествоНовое
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.СерийныеЗапчасти КАК торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[0].Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса[0].Выбрать();
	
	ШаблонКомментария = "%1 %2 %3 %4 - %5";
	
	МассивID = Новый Массив;
	
	СтрокаКомментария = "";
	
	Пока Выборка.Следующий() Цикл
		СтрокаКомментария = СтрШаблон(ШаблонКомментария, Строка(ДокументСсылка), Выборка.ОбъектРемонта,
			Выборка.ВидРемонтныхРабот, Выборка.ДатаНачала, Выборка.ДатаОкончания);
		
		МассивID.Добавить(Выборка.ID);
		Организация = Выборка.Организация;
		Подразделение = Выборка.Подразделение;
	КонецЦикла;
	
	МассивСтрокНоменклатуры = СформироватьМассивНоменклатурыКСписаниюНаСервере(РезультатЗапроса, ВнутреннееПотребление);
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Организация);
	ЗначенияЗаполнения.Вставить("Подразделение", Подразделение);
	ЗначенияЗаполнения.Вставить("Ответственный", ПараметрыСеанса.ТекущийПользователь);
	ЗначенияЗаполнения.Вставить("КлючНазначенияИспользования", "СОЗДАНИЕ_ПОТРЕБЛЕНИЯ_ИЗ_ТОИР");
	ЗначенияЗаполнения.Вставить("МассивСтрокНоменклатуры", МассивСтрокНоменклатуры);
	ЗначенияЗаполнения.Вставить("Комментарий", СтрокаКомментария);
	ЗначенияЗаполнения.Вставить("МассивID", МассивID);
	
	Возврат ЗначенияЗаполнения;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьМассивНоменклатурыКСписаниюНаСервере(РезультатЗапроса, ВнутреннееПотребление)
	
	УжеСписаннаяНоменклатура = ПолучитьТаблицуСписаннойНоменклатуры(ВнутреннееПотребление);
	
	НоменклатураКЗаказу = РезультатЗапроса[1].Выгрузить();
	Запчасти = РезультатЗапроса[2].Выгрузить();
	
	НоменклатураКЗаказу.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	
	Для Каждого Строка Из Запчасти Цикл
		НС = НоменклатураКЗаказу.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Строка);
		НС.Номенклатура = Строка.НоменклатураНовая;
		НС.ХарактеристикаНоменклатуры = Строка.ХарактеристикаНоменклатурыНовая;
		НС.Количество = Строка.КоличествоНовое;
		НС.ЕдиницаИзмерения = Строка.ЕдиницаИзмеренияНовая;
		НС.КоличествоЕдиниц = Строка.КоличествоНовое;
		НС.Серия = Строка.СерияНоменклатурыНовая;
		НС.ХарактеристикиИспользуются = Строка.ХарактеристикиИспользуютсяДляНовой;
	КонецЦикла;
	
	Для Каждого Стр Из НоменклатураКЗаказу Цикл 
		Если Не ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда 
			Стр.КоличествоЕдиниц = Стр.Количество * 1;
		КонецЕсли;
	КонецЦикла;
		
	НоменклатураКЗаказу.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, Серия", "КоличествоЕдиниц");
	
	МассивТовары = Новый Массив;
	Услуга = Перечисления.ТипыНоменклатуры.Услуга;
	Работа = Перечисления.ТипыНоменклатуры.Работа;
	
	Для Каждого Строка Из НоменклатураКЗаказу Цикл
		
		Если Строка.Номенклатура.ТипНоменклатуры = Услуга
			ИЛИ Строка.Номенклатура.ТипНоменклатуры = Работа Тогда
			Продолжить;
		КонецЕсли; 
		КоличествоУжеЗаказаннойНоменклатуры = 0;
		
		Если УжеСписаннаяНоменклатура.Количество() > 0 Тогда
			СтруктураПоиска = Новый Структура("Номенклатура, Характеристика",
				Строка.Номенклатура, Строка.ХарактеристикаНоменклатуры);
				
			НайдСтроки = УжеСписаннаяНоменклатура.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого НайденнаяСтрока Из НайдСтроки Цикл
				КоличествоУжеЗаказаннойНоменклатуры = КоличествоУжеЗаказаннойНоменклатуры + НайденнаяСтрока.Количество;
			КонецЦикла; 
		КонецЕсли;
		
		Если УжеСписаннаяНоменклатура.Количество() = 0
			Или Строка.КоличествоЕдиниц > КоличествоУжеЗаказаннойНоменклатуры Тогда
			
			Структура = Новый Структура("Номенклатура, Характеристика, ХарактеристикиИспользуются, Количество, Серия",
				Строка.Номенклатура,
				Строка.ХарактеристикаНоменклатуры,
				Ложь,
				(Строка.КоличествоЕдиниц - КоличествоУжеЗаказаннойНоменклатуры),
				Строка.Серия);
			МассивТовары.Добавить(Структура);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивТовары;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТаблицуСписаннойНоменклатуры(ВнутреннееПотребление)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладах.Характеристика КАК Характеристика,
	|	СУММА(ТоварыНаСкладах.ВНаличии) КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
	|ГДЕ 
	|	ТоварыНаСкладах.Регистратор = &ВнутреннееПотребление
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладах.Номенклатура,
	|	ТоварыНаСкладах.Характеристика";
	
	Запрос.УстановитьПараметр("ВнутреннееПотребление", ВнутреннееПотребление);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

&НаСервере
Функция СформироватьМассивНоменклатурыКЗаказуСервере(ID)
	
	//УжеЗаказаннаяНоменклатура = ПолучитьТаблицуЗаказаннойНоменклатуры(ID);
	//
	//Если ТипЗнч(ID) = Тип("Массив") Тогда
	//	НоменклатураКСписанию = Объект.МатериальныеЗатраты.Выгрузить();
	//	ЗапчастиКСписанию = Объект.ЗапчастиРемонта.Выгрузить();
	//Иначе
	//	НоменклатураКСписанию = Объект.МатериальныеЗатраты.Выгрузить(Новый Структура("РемонтыОборудования_ID",ID));
	//	ЗапчастиКСписанию = Объект.ЗапчастиРемонта.Выгрузить(Новый Структура("РемонтыОборудования_ID",ID));
	//КонецЕсли;	
	//
	//Для Каждого СтрокаЗапчасти Из ЗапчастиКСписанию Цикл
	//	СтрокаНоменклатуры = НоменклатураКСписанию.Добавить();
	//	ЗаполнитьЗначенияСвойств(СтрокаНоменклатуры, СтрокаЗапчасти);
	//	СтрокаНоменклатуры.КоличествоЕдиниц = СтрокаЗапчасти.Количество;
	//КонецЦикла;

	//НоменклатураКСписанию.Свернуть("Номенклатура, ХарактеристикаНоменклатуры", "КоличествоЕдиниц");
	//
	//Товары = Новый Массив;
	//Услуга = Перечисления.ТипыНоменклатуры.Услуга;
	//Работа = Перечисления.ТипыНоменклатуры.Работа;
	//	
	//Для Каждого Строка Из НоменклатураКСписанию Цикл
	//	
	//	Если Строка.Номенклатура.ТипНоменклатуры = Услуга 
	//		ИЛИ Строка.Номенклатура.ТипНоменклатуры = Работа Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	КоличествоУжеЗаказаннойНоменклатуры = 0;
	//	
	//	Если УжеЗаказаннаяНоменклатура.Количество() > 0 Тогда
	//		НайдСтроки = УжеЗаказаннаяНоменклатура.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Строка.Номенклатура,Строка.ХарактеристикаНоменклатуры));
	//		
	//		Если Не НайдСтроки = Неопределено Тогда
	//			Для Каждого НайденнаяСтрока Из НайдСтроки Цикл
	//				КоличествоУжеЗаказаннойНоменклатуры = КоличествоУжеЗаказаннойНоменклатуры + НайденнаяСтрока.Количество;
	//			КонецЦикла; 
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	Если УжеЗаказаннаяНоменклатура.Количество() = 0
	//		ИЛИ Строка.КоличествоЕдиниц > КоличествоУжеЗаказаннойНоменклатуры Тогда
	//		
	//		Структура = Новый Структура("Номенклатура, Характеристика, Количество",
	//		Строка.Номенклатура,
	//		Строка.ХарактеристикаНоменклатуры,
	//		(Строка.КоличествоЕдиниц - КоличествоУжеЗаказаннойНоменклатуры));
	//		Товары.Добавить(Структура);
	//		
	//	КонецЕсли;	
	//	
	//КонецЦикла;
	//
	//Если Товары.Количество() > 0 Тогда
	//	Возврат Товары;
	//Иначе
	//	Возврат Неопределено;
	//КонецЕсли; 
	
КонецФункции

&НаСервере
Процедура СписаниеНеТребуетсяНаСервере(АктПоРемонту)
	
	НовыйДокумент = Документы.проф_СписаниеТМЦНеТребуется.СоздатьДокумент();
	НовыйДокумент.Автор = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокумент.АктОВыполненииЭтапаРабот = АктПоРемонту;
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	
	ВыбранныеСтроки = Расшифровка.НайтиСтроки(Новый Структура("СформироватьДокумент", Истина));
	
	Для Каждого СтрокаТЧ Из ВыбранныеСтроки Цикл
		
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
		НоваяСтрока.Номенклатура = СтрокаТЧ.НоменклатураАкт;
		НоваяСтрока.Характеристика = СтрокаТЧ.ХарактеристикаАкт;
		НоваяСтрока.Количество = СтрокаТЧ.КоличествоАкт;
		
	КонецЦикла;
	
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Создан документ %1'"), НовыйДокумент.Ссылка);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, НовыйДокумент.Ссылка);
	Исключение
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось создать документ по причине: %1'"), ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	ЗаполнитьПолнуюТаблицуРасшифровки();
	
КонецПроцедуры

&НаСервере 
Процедура ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументовСервер(Результат, ДополнительныеПараметры)
	
	Если Результат <> Неопределено И ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		
		Документы.торо_АктОВыполненииЭтапаРабот.проф_ДвиженияПоРегистру_проф_СоответствиеАктовИВнутреннегоПотребления(ДополнительныеПараметры.АктПоРемонту);
		ЗаполнитьПолнуюТаблицуРасшифровки();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
//-- Проф-ИТ, #329, Соловьев А.А., 08.11.2023
